@api
Feature: Тестирование API на примере Rick and Morty

  Scenario: Получить информацию о персонаже, сравнить с расой и местоположением последнего персонажа из последнего эпизода
    Given  Установить базовый url и header
    Given Передать параметры запроса для персонажа Morty Smith
    Given Установить эндпоинт character/
    And   Отправить GET запрос
    Then Проверить статус код 200
    And Получить информацию о персонаже
    Then Получить информацию о последнем эпизоде
    And Получить информацию о последнем персонаже эпизода
    Then Сравнить расу и местонахождение персонажей



