@rickAndMorty
Feature: Тестирование API на примере Рик и Морти

  Scenario Outline: Получить информацию о персонаже, сравнить с расой и местоположением последнего персонажа из последнего эпизода
    Given Отправить <request> запрос на <endpoint> о персонаже  <name> и получить статус <status>
    Then Получить информацию о последнем эпизоде
    Then Получить последнего персонажа последнего эпизода
    And  Получить информацию о последнем персонаже последнего эпизода
    Then Сравнить расу и местонахождение персонажей

    Examples:
      | request | endpoint  | name        | status |
      | GET     | character | Morty Smith | 200    |

